uhnp/src/Catalogs/ГруппыВНАМСФО/ГруппыВНАМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыВНАМСФО</name>
  <attributes>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВНА</name>
    <type>
      <types>EnumRef.ТипыВНА</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельУчетаВНА</name>
    <type>
      <types>EnumRef.МоделиУчетаВНАМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПервоначальнойСтоимости</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПервоначальнойСтоимостиСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПервоначальнойСтоимостиСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПервоначальнойСтоимостиСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНакопленнойАмортизации</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНакопленнойАмортизацииСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНакопленнойАмортизацииСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНакопленнойАмортизацииСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыПереоценки</name>
    <type>
      <types>CatalogRef.ПараметрыПереоценкиВНАМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыОбесценения</name>
    <type>
      <types>CatalogRef.ПараметрыОбесцененияВНАМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыВыбытия</name>
    <type>
      <types>CatalogRef.ПараметрыВыбытияВНАМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment> Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыАмортизации</name>
    <type>
      <types>CatalogRef.ПараметрыАмортизацииВНАМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыУчетаНЗС</name>
    <type>
      <types>CatalogRef.ГруппыВНАМСФО</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Enums/ТипыВНА/ТипыВНА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВНА</name>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>НематериальныйАктив</name>
  </enumValues>
  <enumValues>
    <name>ИнвестиционноеИмущество</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеСтроительство</name>
  </enumValues>
  <enumValues>
    <name>БиологическийАктив</name>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныйАктивДляПродажи</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ГруппыВНАМСФО/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере(ЭтаФорма);
	КонецЕсли;
	
	ТипНЗС = ПредопределенноеЗначение("Перечисление.ТипыВНА.НезавершенноеСтроительство");
	Если Объект.ТипВНА = ТипНЗС Тогда
		Объект.ПараметрыУчетаНЗС = ПредопределенноеЗначение("Справочник.ГруппыВНАМСФО.ПустаяСсылка");
	КонецЕсли;
	
	ЭтаФорма.ВводВЭксплуатациюВМоментПоступления = Объект.ПараметрыУчетаНЗС.Пустая();
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПодготовитьФормуНаСервере(ЭтаФорма)
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЭтаФорма.ВводВЭксплуатациюВМоментПоступления 
		И Элементы.ПараметрыУчетаНЗС.Видимость
		И Объект.ПараметрыУчетаНЗС.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнено поле <Параметры учета до ввода в эксплуатацию>'");
		Сообщить(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПараметрыКлассаВНА", ЭтаФорма.КэшируемыеЗначения.ПараметрыКлассовВНА);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ВводВЭксплуатациюВМоментПоступления И Объект.ПараметрыУчетаНЗС.Пустая() Тогда
		ПроверяемыеРеквизиты.Добавить("ПараметрыУчетаНЗС");	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ЗаполнитьНаименование(Команда)
	Объект.Наименование = МСФОКлиентСерверУХ.ПолучитьАвтоНаименованиеПараметрыУчетаВНА(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТипВНАПриИзменении(Элемент)
	
	Объект.НачислятьАмортизацию 
		= (Объект.ТипВНА = ПредопределенноеЗначение("Перечисление.ТипыВНА.ОсновноеСредство") 
		Или Объект.ТипВНА = ПредопределенноеЗначение("Перечисление.ТипыВНА.НематериальныйАктив"));

	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МодельУчетаВНАПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПервоначальнойСтоимостиПриИзменении(Элемент)
	МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(ЭтаФорма, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СчетНакопленнойАмортизацииПриИзменении(Элемент)
	МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(ЭтаФорма, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура НачислятьАмортизациюПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВводВЭксплуатациюПриПоступленииПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПодготовитьФормуНаСервере(Форма)
	
	Форма.КэшируемыеЗначения = Новый Структура;	
	Форма.КэшируемыеЗначения.Вставить("ИменаСубконто", 			Справочники.ГруппыВНАМСФО.ПолучитьИменаСубконто());
	Форма.КэшируемыеЗначения.Вставить("КлючевыеСубконто", 		МСФОВНАУХ.ПолучитьКлючевыеСубконтоВНА());
	Форма.КэшируемыеЗначения.Вставить("МоделиУчетаВНАМСФО", 	МСФОВызовСервераУХ.ПолучитьСтруктуруСоЗначениямиПеречисления("МоделиУчетаВНАМСФО"));
	Форма.КэшируемыеЗначения.Вставить("ПараметрыКлассовВНА", 	Перечисления.ТипыВНА.ПолучитьПараметры());
	
	МСФОКлиентСерверУХ.УстановитьПланСчетов(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	МоделиУчетаВНАМСФО = Форма.КэшируемыеЗначения.МоделиУчетаВНАМСФО;
	
	ПараметрыТипаВНА = Форма.КэшируемыеЗначения.ПараметрыКлассовВНА.Получить(Объект.ТипВНА);
	Если ПараметрыТипаВНА = Неопределено Тогда
		ПараметрыТипаВНА = Форма.КэшируемыеЗначения.ПараметрыКлассовВНА
			.Получить(ПредопределенноеЗначение("Перечисление.ТипыВНА.НезавершенноеСтроительство"));
	КонецЕсли;
	
	Элементы.НачислятьАмортизацию.Доступность = ПараметрыТипаВНА.НачислятьАмортизацию;
	Если Не ПараметрыТипаВНА.НачислятьАмортизацию Тогда
		Объект.НачислятьАмортизацию = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаСчетНакопленнойАмортизации.Видимость = Объект.НачислятьАмортизацию;
	Элементы.ПараметрыАмортизации.Видимость = Объект.НачислятьАмортизацию;
	
	Если Не Объект.НачислятьАмортизацию И Не Объект.СчетНакопленнойАмортизации.Пустая() Тогда
		
		Объект.СчетНакопленнойАмортизации = Неопределено;
		Объект.СчетНакопленнойАмортизацииСубконто1 = Неопределено;
		Объект.СчетНакопленнойАмортизацииСубконто2 = Неопределено;
		Объект.СчетНакопленнойАмортизацииСубконто3 = Неопределено;
		
	КонецЕсли;
	
	Элементы.ПараметрыВыбытия.Видимость = ПараметрыТипаВНА.ПараметрыВыбытия;
	Если Не ПараметрыТипаВНА.ПараметрыВыбытия Тогда
		Объект.ПараметрыВыбытия = ПредопределенноеЗначение("Справочник.ПараметрыВыбытияВНАМСФО.ПустаяСсылка");
	КонецЕсли;
	
	Если ПараметрыТипаВНА.МодельУчетаВНА = "" Тогда
		
		Элементы.МодельУчетаВНА.Доступность = Истина;
		Элементы.МодельУчетаВНА.Видимость = Истина;
		
	ИначеЕсли ПараметрыТипаВНА.МодельУчетаВНА = "НеИспользовать" Тогда
		
		Элементы.МодельУчетаВНА.Видимость = Ложь;
		Объект.МодельУчетаВНА = Неопределено;
		
	Иначе
		
		МоделиУчетаВНАМСФО.Свойство(ПараметрыТипаВНА.МодельУчетаВНА, Объект.МодельУчетаВНА);
		Элементы.МодельУчетаВНА.Видимость = Истина;
		Элементы.МодельУчетаВНА.Доступность = Ложь;
		
	КонецЕсли;
	
	//Элементы.ПараметрыОбесценения.Видимость = ПараметрыКлассаВНА.ПараметрыОбесценения И (Объект.МодельУчетаВНА = МоделиУчетаВНАМСФО.УчетПоФактическимЗатратам);
	Элементы.ПараметрыПереоценки.Видимость = ПараметрыТипаВНА.ПараметрыПереоценки
		И (Объект.МодельУчетаВНА = МоделиУчетаВНАМСФО.УчетПоПереоцененнойСтоимости);
		
	ТекстТип = ?(Объект.ТипВНА.Пустая(), НСтр("ru = 'Внеоборотный актив'"), Объект.ТипВНА);
	Форма.Заголовок = Объект.Наименование + "(" + ТекстТип + ")";
	
	ТипНЗС = ПредопределенноеЗначение("Перечисление.ТипыВНА.НезавершенноеСтроительство");
	Элементы.ВводВЭксплуатациюВМоментПоступления.Видимость = (Форма.Объект.ТипВНА <> ТипНЗС);
	Элементы.ПараметрыУчетаНЗС.Видимость = (Форма.Объект.ТипВНА <> ТипНЗС) И Не Форма.ВводВЭксплуатациюВМоментПоступления;
	Если Не Элементы.ПараметрыУчетаНЗС.Видимость Тогда
		Объект.ПараметрыУчетаНЗС = Неопределено;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПланСчетовПриИзменении(Элемент)

	МСФОКлиентСерверУХ.УстановитьПланСчетов(ЭтаФорма);
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
